# 有如下员工 使用字典完成数据记录 使用for循环对于级别为1的员工级别上升一级 薪水增加1000元
info_dict = {'mew':{'部门':'科技部','工资':3000,'级别':1},
             'dog':{'部门':'市场部','工资':5000,'级别':2},
             'pig': {'部门': '市场部', '工资': 7000, '级别': 3},
             'rat': {'部门': '科技部', '工资': 4000, '级别': 1},
             'panda': {'部门': '市场部', '工资': 6000, '级别': 2},
             }
print(f"全体员工当前信息如下：{info_dict}")
for inf in info_dict:
        if info_dict[inf]['级别'] == 1:
            info_dict[inf]['级别'] = 2
            info_dict[inf]['工资'] += 1000

       # if tmp_dict[inf]['级别'] == '1':
print(f"全体员工级别为1的员工完成升级加薪后信息如下：{info_dict}")



